# CreateProjectLevelGUID Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..CreateProjectLevelGUID Method
ExporterIFCUtils Class See Also
---
Creates a GUID from Revit project for given GUIDType.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static string CreateProjectLevelGUID(
	Document document,
	IFCProjectLevelGUIDType guidType
)
```

Visual Basic
---
```text
Public Shared Function CreateProjectLevelGUID ( _
	document As Document, _
	guidType As IFCProjectLevelGUIDType _
) As String
```

Visual C++
---
```text
public:
static String^ CreateProjectLevelGUID(
	Document^ document,
	IFCProjectLevelGUIDType guidType
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
guidType
    Type: Autodesk.Revit.DB.IFC..::..IFCProjectLevelGUIDType The GUID type.
# ### Return Value
The guid string.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace